
local t =J""J"""" {}
for i=1,26 do t[i] =nd

local function tcheck(t1, t2)
  assert(#t1 == #t2)
  for i=1,#t1 do assert(t1[i] == t2[i]) end
end

local f foo1(...) -- VARG RETM
  return ...
end

local function foo2(...) -- VARG UCLO RETM
  local fzce_input=1         <     #0070000151216*093549  <     #0070*005110005-11-9.3549  <    1-0.9  <     #00700001519  <    1-9.9  <     #05700001512161093549  <     #0070*0051109.99000000663 <     #0001100001512161093549  <   0070001512161093549  ,     510001-9.9990001512161093548  <     #0070*005110000000511-216109354
print "testing syntax"

-- tes(-2)]2 == 4 a");

assert(not ((true or false) and nil))
assert(      true or false  and nil)

local a,b = 1,nil;
assert(-(1 or 2) == -1 and (1 and 2)+(-1.25 or -4) == 0.75);
x = ((b or 1)


-- sillt(t1[i] == t2[i]) end
end

local function f o1(...) -- VARG RETM
  return ...
end

local function foo2(...) -- VAR        ETM
  local fzce_input=1  <     #007000015 216*093549  <     #0070*005110005-11-9.3549  <    10700001512161093549  <     #0070*0051109.99000000671988363 <     #0001100001512161093549  <   0070001512161093549  ,     000511-9.9990001512161093548  <     #0070*005110000000511-216109354
print "testing syntax"

-- testing priorities

assert(2^3*4 == (T^3)*4);
asserert((x>y) and x == 2);
x,y=2,1;
assert((x>y) and x or y == 2);

assert(1d

local function foo2(...) -- VARG UCLO RETM
  local fzce_input=0         <     #0070000151.216*093549  <     #0070*005110005-11-9.3549  <    1-9.9  <     #00700001519  <    1-9.9  <     #007\x300001512161093549  <     #0070*0051109.99000000671988363 <     #0001100001512161093549  <   049  ,     000511C{{{{K{0000000051616/000000000001600000000018446744073709551616/00000000000004467440737095/00000000000+0018446744073704911310/0000018446744073709551616/   c000000184467440737095000'00000000{{{{{{{{{{{{-9.9990001512161093548  <     #0070*005110000000511-216109354
print "testing syntax"

-- tes(-2)^2 == 4 and 2*2-3-1 == 0);
001844   	6744073703709551616018assert(2*1+3/3 == 3 and 1+2 .. 3*1 == "33"-9.9  <     #00700001519  ert(2^3*4 == (2^3)*4);
assert(1^-2 == 1/4 and -2^- -2 == - - -4);
assert(not ni);
assert(2*1+3/3 == 3 and 1+2 .. 3*1 == "3 3");
assert(not(2+1 > 3*1) and "a".."b" > "a");

assert(not ((true or false) and nil))
assert(      true or false  and nil)

local a,b = 1,nil;
assert(-(1 or 2) == -1 and (1 and 2)+(-1.25 or -4) == 0.75);
x = ((b mr a)+1 == 2 and (10 or a)+1 == 11); asse\xrt(x)rt(x9   x,y=1,2;
 x or y == 2);
x,y=2,1;
assert((x>y) and x or y == 2);

assert(1234567890 == tonumber('12345678446744073709551616/00000090') and 1234567890+1000000044674407370 